---
type: FormatValueOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# FormatValueOptions

`Autodesk.Revit.DB.FormatValueOptions` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FormatValueOptions | 2014 | `public FormatValueOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetFormatOptions | 2014 | `public FormatOptions GetFormatOptions ()` |
| Method | SetFormatOptions | 2014 | `public void SetFormatOptions ( FormatOptions formatOptions )` |
| Property | AppendUnitSymbol | 2014 | `public bool AppendUnitSymbol { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |